import random

def get_numbers_ticket(min: int, max: int, quantity: int) -> list:
    """
    Генерує список унікальних випадкових чисел у заданому діапазоні.\n
    Аргументи:
    min (int): Мінімальне можливе число у наборі (не менше 1).\n
    max (int): Максимальне можливе число у наборі (не більше 1000).\n
    quantity (int): Кількість чисел у наборі (значення між min і max).\n
    Повертає:
    list: Відсортований список унікальних випадкових чисел.
    Якщо параметри некоректні – повертає пустий список.
    """
    # docstring опис роботи функції
    list_of_numbers = []    # Створюємо порожній список в який буде занесено фінальний результат.
    set_of_num = set()      # Створюємо множину, яка забезпечить унікальність чисел.
    if min < 1 or min >= max or max > 1000 or max - min <= quantity:
        # Перевіряємо коректність заданих аргументів функції.
        return list_of_numbers      # Якщо якийсь з аргументів задано неправильно, повертаємо порожній список.
    else:
        while True:     # Використовуємо цикл while для повторення коду нижче до заданої умови True.
            if len(set_of_num) != quantity:
                set_of_num.add(random.randint(min, max))
                # Додаємо елементи до множини, поки їх кількість не дорівнюватиме заданому quantity.
            else:
                break   # Перериваємо цикл після досягнення умови.

    list_of_numbers = list(set_of_num)  # Перетворюємо множину в список і заносимо значення до фінального списку.
    list_of_numbers.sort()  # Сортуємо отриманий список.
    return list_of_numbers

lottery_numbers = get_numbers_ticket(100, 500, 399)
print("Ваші лотерейні числа:", lottery_numbers)