from datetime import datetime
    
def get_days_from_today(date: str):
    """
    Розраховує кількість днів між заданою датою та сьогоднішнім днем.\n
    Аргументи:
    date (str): Дата у форматі 'YYYY-MM-DD' (наприклад, '2025-01-27').\n
    Повертає:
    int: Кількість днів від заданої дати до сьогоднішньої.\n
    Якщо дата введена у неправильному форматі, повертає повідомлення про помилку.
    """
    # docstring опис роботи функції
    today = datetime.now().date()  # Додаємо змінну today, призначаємо їй поточну дату і приводимо до типу date.
    try:                    # Вводимо блок перевірки на помилку.
        difference = datetime.strptime(date, "%Y-%m-%d").date() - today
        # Вводимо нову змінну і присвоюємо їй резутьтат обрахунку різниці заданої дати і поточної.
        return difference.days   # Виводимо результат, якщо формат заданої дати був відповвідний до 'РРРР-ММ-ДД'.
    
    except ValueError:      # Опрацьовуємо помилку неправильного формату вхідних данних.
        
        return "Дата має бути вказана у форматі: 'РРРР-ММ-ДД\'"  

print(get_days_from_today('2025-10-09'))
